{
  "books": [
    {
      "id": 1,
      "name": "Мастер и Маргарита",
      "author": "Михаил Булгаков",
      "publication_year": 1967,
      "category": "Роман, Фантастика, Сатира",
      "describe": "Культовый роман о визите дьявола в Москву 1930-х годов, переплетающийся с историей о Понтии Пилате и Иешуа Га-Ноцри. История любви, искусства и вечной борьбы добра и зла."
    },
    {
      "id": 2,
      "name": "Преступление и наказание",
      "author": "Фёдор Достоевский",
      "publication_year": 1866,
      "category": "Психологический роман, Философия",
      "describe": "История бывшего студента Родиона Раскольникова, который совершает убийство, чтобы доказать свою теорию о «праве сильной личности». Глубокое исследование совести, морали и человеческой психологии."
    },
    {
      "id": 3,
      "name": "Война и мир",
      "author": "Лев Толстой",
      "publication_year": 1869,
      "category": "Исторический роман, Эпопея",
      "describe": "Монументальная эпопея о судьбах русских аристократических семей во время наполеоновских войн 1805-1812 годов. Роман о любви, войне, истории и поиске смысла жизни."
    },
    {
      "id": 4,
      "name": "1984",
      "author": "Джордж Оруэлл",
      "publication_year": 1949,
      "category": "Антиутопия, Политическая фантастика",
      "describe": "Антиутопический роман о тоталитарном обществе, где правительство осуществляет тотальный контроль над каждым аспектом жизни граждан. История Уинстона Смита, который начинает сомневаться в системе."
    },
    {
      "id": 5,
      "name": "Гарри Поттер и философский камень",
      "author": "Джоан Роулинг",
      "publication_year": 1997,
      "category": "Фэнтези, Приключения",
      "describe": "Первая книга серии о юном волшебнике Гарри Поттере, который узнает на свой 11-й день рождения, что он волшебник и зачислен в школу магии Хогвартс. Начинаются его приключения в мире волшебства."
    },
    {
      "id": 6,
      "name": "Маленький принц",
      "author": "Антуан де Сент-Экзюпери",
      "publication_year": 1943,
      "category": "Философская сказка, Притча",
      "describe": "Философская сказка о маленьком мальчике с другой планеты, который путешествует по разным мирам и встречает разных людей. Книга о дружбе, любви и истинных ценностях в жизни."
    },
    {
      "id": 7,
      "name": "Убить пересмешника",
      "author": "Харпер Ли",
      "publication_year": 1960,
      "category": "Роман воспитания, Драма",
      "describe": "История взросления детей в американском Юге во времена Великой депрессии, рассказанная глазами девочки-подростка. Роман о расизме, несправедливости и моральной целостности."
    },
    {
      "id": 8,
      "name": "Три товарища",
      "author": "Эрих Мария Ремарк",
      "publication_year": 1936,
      "category": "Военный роман, Драма",
      "describe": "История трёх друзей, вернувшихся с Первой мировой войны, и их борьбы за выживание в послевоенной Германии. Роман о дружбе, любви и потерях в трудные времена."
    },
    {
      "id": 9,
      "name": "Анна Каренина",
      "author": "Лев Толстой",
      "publication_year": 1877,
      "category": "Роман, Психологическая драма",
      "describe": "История замужней женщины высшего света, которая влюбляется в молодого офицера. Роман исследует темы любви, брака, общества и морали в царской России."
    },
    {
      "id": 10,
      "name": "Сто лет одиночества",
      "author": "Габриэль Гарсиа Маркес",
      "publication_year": 1967,
      "category": "Магический реализм, Роман",
      "describe": "Сага о семье Буэндиа в вымышленном городе Макондо. Роман, сочетающий реальность и магию, рассказывает о любви, одиночестве, судьбе и цикличности истории."
    }
  ]
}